luxuryJXHZ/tm4c/tm4c23gh6pm/2024科协春测/扩展功能——thd测量/tm4c/USER/time0.c
#include <stdbool.h>
#include "stdbool.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <start.h>
#include <time0.h>


#include "inc/hw_gpio.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "inc/hw_nvic.h"
#include "inc/hw_flash.h"
#include "inc/hw_adc.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_timer.h"

#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/timer.h"
#include "driverlib/pin_map.h"
#include "driverlib/systick.h"
#include "driverlib/ssi.h"
#include "driverlib/adc.h"
#include "driverlib/cpu.h"
//**************************************************************************************
//函数名:TIME_INT
//功能说明：开启time0时钟
//形参：无
//返回值：无
//**************************************************************************************
void TIME_INT()
{	SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
	IntPrioritySet(INT_TIMER0A ,0);
	TimerConfigure(TIMER0_BASE,TIMER_CFG_A_PERIODIC);
	IntEnable (INT_TIMER0A );	
	TimerIntEnable(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
	IntMasterEnable();
	TimerEnable (TIMER0_BASE,TIMER_A );
}
